In [1]:
import sqlite3
import pandas as pd

In [2]:
connection = sqlite3.connect('books.db')

### Select all authorsâ€™ last names from the authors table in descending order.

In [3]:
pd.read_sql('SELECT last FROM authors ORDER BY last DESC', connection)

        last
0       Wald
1      Quirk
2  Hernandez
3  Hernandez
4  Hernandez
5  Hernandez
6     Deitel
7     Deitel
8     Deitel

### Select all book titles from the titles table in ascending order.

In [4]:
pd.read_sql('SELECT * FROM titles ORDER BY title ASC', connection)

         isbn                             title  edition copyright
0  0134289366         Android 6 for Programmers        3      2016
1  0134444302            Android How to Program        3      2017
2  0133976890                  C How to Program        8      2016
3  0134448235                C++ How to Program       10      2017
4  0132151006     Internet & WWW How to Program        5      2012
5  0135404673     Intro to Python for CS and DS        1      2020
6  0134743350               Java How to Program       11      2018
7  0133406954  Visual Basic 2012 How to Program        6      2014
8  0134601548          Visual C# How to Program        6      2017
9  0136151574         Visual C++ How to Program        2      2008

### Use an INNER JOIN to select all the books for a specific author. Include the title, copyright year and ISBN. Order the information alphabetically by title.

In [5]:
pd.read_sql('Select titles.title, titles.copyright, author_isbn.isbn From (titles inner join author_isbn on titles.isbn = author_ISBN.isbn) inner join authors on authors.id = author_ISBN.id Where authors.first = \'Harvey\' and authors.last = \'Deitel\' Group By authors.id, titles.title', connection)

                              title copyright        isbn
0         Android 6 for Programmers      2016  0134289366
1            Android How to Program      2017  0134444302
2                  C How to Program      2016  0133976890
3                C++ How to Program      2017  0134448235
4     Internet & WWW How to Program      2012  0132151006
5     Intro to Python for CS and DS      2020  0135404673
6               Java How to Program      2018  0134743350
7  Visual Basic 2012 How to Program      2014  0133406954
8          Visual C# How to Program      2017  0134601548
9         Visual C++ How to Program      2008  0136151574

### Insert a new author into the authors table.

In [6]:
c = connection.cursor()

In [7]:
c.execute("""INSERT INTO authors(first,last) VALUES(\'Alejandra\', \'Hernandez\')""")

In [8]:
connection.commit()

In [9]:
#Display of tables after commit

In [10]:
pd.read_sql('SELECT * FROM authors',connection)

                id      first       last
0                1       Paul     Deitel
1                2     Harvey     Deitel
2                3      Abbey     Deitel
3                4        Dan      Quirk
4                5  Alexander       Wald
5                6  Alejandra  Hernandez
6                7  Alejandra  Hernandez
7  123456789456123  Alejandra  Hernandez
8  123456789456124  Alejandra  Hernandez
9  123456789456125  Alejandra  Hernandez

### Insert a new title for an author. Remember that the book must have an entry in the author_ISBN table and an entry in the titles table.